Revit 2027 API
BuiltInFailures.RebarFailures.RebarCrankCannotBeAddedToShape Property
 Cannot add crank to this type of Rebar Shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarCrankCannotBeAddedToShape { get; }
Public Shared ReadOnly Property RebarCrankCannotBeAddedToShape As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarCrankCannotBeAddedToShape {
	FailureDefinitionId^ get ();
}
static member RebarCrankCannotBeAddedToShape : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace